Repository: Abdulrhman-a1/Mugheeth
Catalog: lib/l10n/app_*.arb
Languages: ar

# welcome_title
source: Welcome to Mugheeth!
ar: اهلًا بك في مغيث!

# welcome_description
source: Mugheeth guides you to the right medical care at the moment you need it.
ar: مُغيث يُرشدك للرعاية الطبية الصحيحة، في اللحظة التي تحتاجها

# chat_section_title
source: Don't wait.. Know your condition
ar: لا تنتظر.. اعرف حالتك الآن!

# chat_section_description
source: Your healthcare starts with a conversation, Mugheeth helps you understand your health status.
ar: رعايتك الصحية تبدأ بمحادثة، وتمنحك رؤية أوضح لحالتك قبل زيارة المستشفى

# medical_history_title
source: Get your medical history
ar: احتفظ بتاريخك الطبي

# medical_history_description
source: Mugheeth helps you understand your health status before visiting the hospital.
ar: يساعدك مُغيث في معرفة حالتك الصحية قبل زيارة المستشفى

source: Next
ar: التالي

source: Skip
ar: تخطي

# done
source: Get Started
ar: ابدأ الآن

source: Login
ar: تسجيل الدخول

source: Mugheeth
ar: مُغيث

# hint
source: how do you feel?
ar: وش تشكي منه؟

source: chat
ar: المحادثة

# history
source: medical history
ar: السجل الطبي

source: feedback
ar: التقييم

source: FAQ
ar: الاسئلة الشائعة

source: settings
ar: الاعدادات

# policy
source: privacy policy
ar: سياسة الخصوصية

source: logout
ar: تسجيل الخروج

source: New Chat
ar: محادثة جديدة

# chest_pain_title
source: Chest Pain
ar: ألم في الصدر

# chest_pain_description
source: I have persistent chest pain for several days.
ar: أشعر بألم في أعلى الصدر مستمر لعدة أيام.

# fever_title
source: Fever
ar: حرارة

# fever_description
source: My temperature has been high since the morning.
ar: حرارتي مرتفعة منذ الصباح.

# headache_title
source: Headache
ar: صداع

# headache_description
source: Persistent pain on the side of my head for long periods.
ar: ألم في جانب الرأس مستمر لفترات طويلة.

# eye_redness_title
source: Eye Redness
ar: احمرار العين

# eye_redness_description
source: My eye color has turned red.
ar: تغير لون عيني إلى الاحمرار.

# persistent_cough_title
source: Persistent Cough
ar: كحة مستمرة

# persistent_cough_description
source: I have been coughing since the morning.
ar: أشعر بالكحة منذ الصباح.

# medical_priority_title
source: Medical Priority Classification
ar: تصنيف الأولوية الطبية

# medical_priority_description
source: Based on the entered symptoms, the app classifies the condition according to the Canadian Triage and Acuity Scale (CTAS), helping the user understand whether immediate medical care is needed or if they can wait.
ar: بناءً على الأعراض المدخلة، يقوم التطبيق بتصنيف الحالة وفقًا لمقياس الفرز الكندي (CTAS)، مما يساعد المستخدم في معرفة ما إذا كان يحتاج إلى رعاية طبية فورية أو يمكنه الانتظار

# instant_assessment_title
source: Instant Assessment
ar: تقييم فوري

# instant_assessment_description
source: Users can input their symptoms, and the app analyzes them using AI to provide an assessment of their severity level.
ar: يمكن للمستخدم إدخال الأعراض التي يعاني منها ليقوم التطبيق بتحليلها باستخدام الذكاء الاصطناعي وتقديم تقييم لمستوى خطورتها.

# hospital_map_title
source: Hospital Map
ar: خريطة المستشفيات

# hospital_map_description
source: Users can find the nearest hospitals and medical centers based on their geographical location, with expected wait times for each hospital.
ar: يمكن للمستخدم العثور على أقرب المستشفيات والمراكز الطبية بناءً على موقعه الجغرافي، مع عرض أوقات الانتظار المتوقعة لكل مستشفى.

# electronic_medical_record_title
source: Electronic Medical Record
ar: سجل طبي إلكتروني

# electronic_medical_record_description
source: The app allows users to save their health history, past symptoms, and medical assessments, making it easier to track their health over time.
ar: يتيح التطبيق للمستخدمين حفظ تاريخهم الصحي، الأعراض السابقة، والتقييمات الطبية، مما يسهل تتبع الحالة الصحية مع مرور الوقت.

# multilingual_support_title
source: Multilingual Support
ar: دعم متعدد اللغات

# multilingual_support_description
source: The app is available in multiple languages to ensure ease of use for different groups and users.
ar: التطبيق متاح بعدة لغات لضمان سهولة الاستخدام لمختلف الفئات والمستخدمين.

# ease_of_use_title
source: Ease of Access and Use
ar: سهولة الوصول و الإستخدام

# ease_of_use_description
source: The app is designed to be simple and user-friendly, suitable for all age groups.
ar: تصميم التطبيق بسيط وسهل الاستخدام ليتناسب مع جميع الفئات العمرية.

source: Mugheeth Features
ar: خدمات مُغيث

source: need help?
ar: تحتاج مساعدة؟

# service_not_allowed
source: Serive not available
ar: الخدمة غير متاحة

# service_not_allowed_button
source: Unregistered users cannot access this service, please login to access the service
ar: المستخدم غير المسجّل يمكنه الاطلاع على حالته الصحية فقط، وللاستفادة من مزيد من الخدمات يرجى تسجيل الدخول.

# service_not_allowed_desc
source: Please login to access the service
ar: الرجاء تسجيل الدخول للوصول على الخدمة

# welcome_login_title
source: Welcome
ar: اهلًا بك

# welcome_login_description
source: Login to continue
ar: سجل دخولك للمتابعة

source: Email
ar: البريد الإلكتروني

source: password
ar: كلمة المرور

# password_confirom
source: password confirmation
ar: تأكيد كلمة المرور

# register_button
source: Create Account
ar: إنشاء حساب

source: First name
ar: الاسم الأول

source: Last name
ar: الاسم الأخير

# login_button
source: Login
ar: تسجيل الدخول

source: forgot password?
ar: نسيت كلمة المرور؟

# register
source: Don't have an account? Register now
ar: ليس لديك حساب؟ سجل الآن

# login_sucess
source: Login successful
ar: تم تسجيل الدخول بنجاح

# empty_history
source: No medical history found, start a new chat to create a history
ar: لا توجد سجلات طبية، ابدأ محادثة جديدة لإنشاء سجل طبي

# medical_history_bottomsheet_title
source: Medical Records
ar: سجلاتك الطبية

# medical_history_bottomsheet_description
source: Now you can get your medical record from Mugheeth
ar: الان بإمكانك الحصول على سجلك الطبي من مُغيث

# feedback_title
source: Feedback
ar: قيم تجربتك

# feedback_description
source: Evaluate your experience with Mugheeth
ar: وش رايك في تجربتك مع مُغيث؟

# feedback_hint
source: Enter your comment here
ar: أكتب تعليقك هنا

# feedback_submit
source: Send
ar: إرسال

# feedback_sent
source: Your feedback has been sent successfully
ar: تم إرسال تعليقك بنجاح

# feedback_empty
source: Please enter your feedback
ar: الرجاء كتابة تعليق قبل الإرسال

# faq_title
source: FAQ
ar: الاسئلة الشائعة

# faq_description
source: What do you want to know?
ar: وش حاب تعرف عن مُغيث؟

# empty_complain
source: Please enter your complaint first
ar: الرجاء كتابة شكواك قبل الإرسال

# complain_sent
source: Your complaint has been sent successfully
ar: تم إرسال شكواك بنجاح

# email_empty
source: Please enter your email
ar: الرجاء إدخال البريد الإلكتروني

# pass_empty
source: Please enter your password
ar: الرجاء إدخال الرقم السري

# gender_empty
source: Please enter your gender
ar: الرجاء إدخال الجنس

# firstname_empty
source: Please enter your first name
ar: الرجاء إدخال الاسم الاول

# lastname_empty
source: Please enter your last name
ar: الرجاء إدخال الاسم الاخير

# bdate_empty
source: Please enter your birth date
ar: الرجاء إدخال تاريخ الميلاد

# unmatch_pass
source: Passwords do not match
ar: كلمات المرور غير متطابقة

source: Invalid email
ar: البريد الإلكتروني غير صحيح

# invalid_name
source: Enter a valid name
ar: ادخل اسمك بشكل صحيح

# invalid_last_name
source: Enter a valid last name
ar: ادخل اسم العائلة بشكل صحيح

# question1
source: What is Mugheeth's medical triage system?
ar: ما هو نظام مُغيث للفرز الطبي؟

# answer1
source: Mugheeth is an advanced AI-powered system that analyzes user-inputted symptoms to assess the patient's condition and determine the medical priority level based on global triage standards such as CTAS.
ar: مُغيث هو نظام ذكاء اصطناعي متقدم يعتمد على تحليل الأعراض المدخلة من قبل المستخدمين لتقييم حالة المريض وتحديد مستوى الأولوية الطبية وفقًا لمعايير الفرز العالمية مثل CTAS.

# question2
source: How does Mugheeth work?
ar: كيف يعمل مُغيث؟

# answer2
source: Mugheeth utilizes artificial intelligence techniques such as Natural Language Processing (NLP) and Retrieval-Augmented Generation (RAG) to analyze symptoms and provide instant recommendations regarding medical priority and necessary steps for the patient.
ar: يعتمد مُغيث على تقنيات الذكاء الاصطناعي، مثل معالجة اللغة الطبيعية (NLP) واسترجاع المعلومات (RAG)، لتحليل الأعراض وتقديم توصيات فورية حول الأولوية الطبية والخطوات اللازمة للمريض.

# question3
source: Can Mugheeth diagnose diseases?
ar: هل يُمكن لمُغيث تشخيص الأمراض؟

# answer3
source: No, Mugheeth does not provide medical diagnoses. It is a decision-support tool that helps assess symptoms and guide patients to the appropriate level of medical care, but it does not replace consulting a healthcare professional.
ar: لا، مُغيث لا يقوم بالتشخيص الطبي. هو أداة دعم قرار تساعد في تقييم الأعراض وتوجيه المرضى إلى مستوى الرعاية الطبية المناسب، ولكنه لا يُغني عن استشارة الطبيب المختص.

# question4
source: What are the benefits of using Mugheeth?
ar: ما الفائدة من استخدام مُغيث؟

# answer4
source: Mugheeth helps reduce overcrowding in emergency departments, improves time and resource management in healthcare, and directs patients more efficiently to the appropriate medical services.
ar: يُساهم مُغيث في تقليل الازدحام في أقسام الطوارئ، تحسين إدارة الوقت والموارد الطبية، وتوجيه المرضى بشكل أسرع إلى الخدمات الصحية المناسبة لحالتهم.

# question5
source: Does Mugheeth support all age groups?
ar: هل يدعم مُغيث جميع الفئات العمرية؟

# answer5
source: Yes, Mugheeth is designed to assess symptoms for different age groups, including children and the elderly, while considering specific medical factors for each category.
ar: نعم، مُغيث مُصمم ليكون قادرًا على تقييم الأعراض لمختلف الفئات العمرية، بما في ذلك الأطفال وكبار السن، ويأخذ في الاعتبار العوامل الطبية الخاصة بكل فئة.

# question6
source: Can Mugheeth be integrated with hospitals and clinics?
ar: هل يمكن دمج مُغيث مع المستشفيات والعيادات؟

# answer6
source: Yes, Mugheeth can be integrated with hospital and clinic systems to provide automated preliminary assessments, helping improve triage processes and ease the burden on medical staff.
ar: نعم، مُغيث يمكن تكامله مع أنظمة المستشفيات والعيادات لتوفير تقييم أولي تلقائي للحالات، مما يُساعد في تحسين عمليات الفرز الطبي وتخفيف الضغط على الكوادر الطبية.

# question7
source: Does Mugheeth provide direct medical consultations?
ar: هل مُغيث يوفر استشارات طبية مباشرة؟

# answer7
source: No, Mugheeth does not offer direct medical consultations, but it can classify cases and connect users with qualified healthcare providers when necessary.
ar: لا، مُغيث لا يُقدم استشارات طبية مباشرة، لكنه يمكن أن يساعد في تصنيف الحالات وربط المستخدمين مع مزودي الرعاية الصحية المؤهلين عند الحاجة.

# question8
source: How can I use Mugheeth?
ar: كيف يمكنني استخدام مُغيث؟

# answer8
source: You can use Mugheeth through the dedicated application or an integrated hospital system where you can input symptoms for analysis and receive relevant recommendations.
ar: يمكنك استخدام مُغيث عبر التطبيق المخصص أو النظام الإلكتروني المتكامل مع المستشفيات، حيث يمكنك إدخال الأعراض ليقوم النظام بتحليلها وتقديم التوصيات المناسبة لحالتك.

# question9
source: Does Mugheeth rely on certified medical sources?
ar: هل يعتمد مُغيث على مصادر طبية معتمدة؟

# answer9
source: Yes, Mugheeth is based on reliable medical databases and sources such as WHO guidelines and the International Classification of Diseases (ICD) to ensure accurate medical recommendations.
ar: نعم، مُغيث يعتمد على قواعد بيانات ومصادر طبية موثوقة، مثل إرشادات منظمة الصحة العالمية (WHO) ونظام التصنيف الدولي للأمراض (ICD)، لضمان دقة التوصيات الطبية.

# question10
source: Does Mugheeth respect medical data privacy?
ar: هل مُغيث يحترم خصوصية البيانات الطبية؟

# answer10
source: Yes, Mugheeth complies with global security and privacy standards such as HIPAA and GDPR to ensure user data protection and confidentiality.
ar: نعم، مُغيث يلتزم بمعايير الأمان والخصوصية العالمية، مثل HIPAA وGDPR، لضمان حماية بيانات المستخدمين وسرية المعلومات الصحية.

# question11
source: Can Mugheeth handle emergency cases?
ar: هل يمكن لمُغيث التعامل مع الحالات الطارئة؟

# answer11
source: Mugheeth helps classify emergency cases, but for critical emergencies, it is always recommended to call an ambulance or visit the nearest hospital immediately.
ar: مُغيث يساعد في تصنيف الحالات الطارئة، ولكن في حالات الطوارئ الحرجة يُوصى دائمًا بالاتصال الفوري بالإسعاف أو التوجه لأقرب مستشفى.

# question12
source: Can Mugheeth suggest home remedies?
ar: هل يُمكن لمُغيث اقتراح علاجات منزلية؟

# answer12
source: In some minor cases, Mugheeth can provide home care tips based on medical guidelines, but it does not replace a doctor's consultation when necessary.
ar: في بعض الحالات البسيطة، يُمكن لمُغيث تقديم نصائح للرعاية المنزلية بناءً على إرشادات طبية معتمدة، ولكن لا يُغني ذلك عن استشارة الطبيب عند الحاجة.

# question13
source: Does Mugheeth support multiple languages?
ar: هل مُغيث يعمل بلغات متعددة؟

# answer13
source: Yes, Mugheeth supports multiple languages, including Arabic and English, allowing it to assist users from diverse backgrounds.
ar: نعم، يدعم مُغيث عدة لغات بما في ذلك العربية والإنجليزية، مما يسمح له بمساعدة المستخدمين من مختلف الجنسيات.

# question14
source: Does Mugheeth use only artificial intelligence?
ar: هل يستخدم مُغيث الذكاء الاصطناعي فقط؟

# answer14
source: Mugheeth combines artificial intelligence (LLMs) with Retrieval-Augmented Generation (RAG) and continuously updated medical databases to provide accurate and effective recommendations.
ar: مُغيث يجمع بين الذكاء الاصطناعي (LLMs) واسترجاع المعلومات (RAG) مع قواعد بيانات طبية محدثة لضمان تقديم توصيات دقيقة وفعالة.

# question15
source: Can Mugheeth predict diseases before symptoms appear?
ar: هل يُمكن لمُغيث التنبؤ بالأمراض قبل ظهور الأعراض؟

# answer15
source: Currently, Mugheeth focuses on analyzing existing symptoms, but future plans include using big data analysis and deep learning to predict potential health risks.
ar: حاليًا، مُغيث يركز على تحليل الأعراض الموجودة، ولكن هناك خطط مستقبلية لاستخدام تقنيات تحليل البيانات الضخمة والتعلم العميق للتنبؤ بالمخاطر الصحية المحتملة.

# settings_title
source: Manage Your Account
ar: إدارة حسابك

# settings_description
source: You can edit your personal information here
ar: تقدر تعدل على معلوماتك الشخصية من هنا

source: Name
ar: الاسم

source: Birth date
ar: تاريخ الميلاد

source: Gender
ar: الجنس

# lang
source: Language
ar: اللغة

# save
source: Save changes
ar: حفط التغييرات

# lang_description
source: Choose your preferred language
ar: اختار اللغة اللي تفضلها

source: Delete Account
ar: حذف الحساب

# recording_title
source: How do you feel?
ar: بِما تشعر؟

# recording_button_text
source: Mugheeth listens...
ar: مغيث يسمع...

source: Contact us
ar: تواصل معنا

# contact_us_description
source: To report any issues, please contact us
ar: للإبلاغ عن مشكلة أو طلب مساعدة

# policy_desc
source: By continuing, you agree to our Privacy Policy
ar: بمجرد تفعيلك للحساب فأنت توافق على سياسة الخصوصية

# opt_title
source: what's your email
ar: وش بريدك؟

# opt_button
source: send OTP
ar: إرسال رمز التحقق

# opt_recived
source: OTP received?
ar: جاك الرمز؟

# opt_code
source: OTP code
ar: رمز التحقق

# otp_resend
source: Resend OTP
ar: ارسل رمز التحقق مرة ثانية
