import 'package:flutter/material.dart';

final List<Map<String, String>> faqItems = [
  {
    'question': 'ما هو نظام مُغيث للفرز الطبي؟',
    'answer':
        'مُغيث هو نظام ذكاء اصطناعي متقدم يعتمد على تحليل الأعراض المدخلة من قبل المستخدمين لتقييم حالة المريض وتحديد مستوى الأولوية الطبية وفقًا لمعايير الفرز العالمية مثل CTAS.',
  },
  {
    'question': 'كيف يعمل مُغيث؟',
    'answer':
        'يعتمد مُغيث على تقنيات الذكاء الاصطناعي، مثل معالجة اللغة الطبيعية (NLP) واسترجاع المعلومات (RAG)، لتحليل الأعراض وتقديم توصيات فورية حول الأولوية الطبية والخطوات اللازمة للمريض.',
  },
  {
    'question': 'هل يُمكن لمُغيث تشخيص الأمراض؟',
    'answer':
        'لا، مُغيث لا يقوم بالتشخيص الطبي. هو أداة دعم قرار تساعد في تقييم الأعراض وتوجيه المرضى إلى مستوى الرعاية الطبية المناسب، ولكنه لا يُغني عن استشارة الطبيب المختص.',
  },
  {
    'question': 'ما الفائدة من استخدام مُغيث؟',
    'answer':
        'يُساهم مُغيث في تقليل الازدحام في أقسام الطوارئ، تحسين إدارة الوقت والموارد الطبية، وتوجيه المرضى بشكل أسرع إلى الخدمات الصحية المناسبة لحالتهم.',
  },
  {
    'question': 'هل يدعم مُغيث جميع الفئات العمرية؟',
    'answer':
        'نعم، مُغيث مُصمم ليكون قادرًا على تقييم الأعراض لمختلف الفئات العمرية، بما في ذلك الأطفال وكبار السن، ويأخذ في الاعتبار العوامل الطبية الخاصة بكل فئة.',
  },
  {
    'question': 'هل يمكن دمج مُغيث مع المستشفيات والعيادات؟',
    'answer':
        'نعم، مُغيث يمكن تكامله مع أنظمة المستشفيات والعيادات لتوفير تقييم أولي تلقائي للحالات، مما يُساعد في تحسين عمليات الفرز الطبي وتخفيف الضغط على الكوادر الطبية.',
  },
  {
    'question': 'هل مُغيث يوفر استشارات طبية مباشرة؟',
    'answer':
        'لا، مُغيث لا يُقدم استشارات طبية مباشرة، لكنه يمكن أن يساعد في تصنيف الحالات وربط المستخدمين مع مزودي الرعاية الصحية المؤهلين عند الحاجة.',
  },
  {
    'question': 'كيف يمكنني استخدام مُغيث؟',
    'answer':
        'يمكنك استخدام مُغيث عبر التطبيق المخصص أو النظام الإلكتروني المتكامل مع المستشفيات، حيث يمكنك إدخال الأعراض ليقوم النظام بتحليلها وتقديم التوصيات المناسبة لحالتك.',
  },
  {
    'question': 'هل يعتمد مُغيث على مصادر طبية معتمدة؟',
    'answer':
        'نعم، مُغيث يعتمد على قواعد بيانات ومصادر طبية موثوقة، مثل إرشادات منظمة الصحة العالمية (WHO) ونظام التصنيف الدولي للأمراض (ICD)، لضمان دقة التوصيات الطبية.',
  },
  {
    'question': 'هل مُغيث يحترم خصوصية البيانات الطبية؟',
    'answer':
        'نعم، مُغيث يلتزم بمعايير الأمان والخصوصية العالمية، مثل HIPAA وGDPR، لضمان حماية بيانات المستخدمين وسرية المعلومات الصحية.',
  },
  {
    'question': 'هل يمكن لمُغيث التعامل مع الحالات الطارئة؟',
    'answer':
        'مُغيث يساعد في تصنيف الحالات الطارئة، ولكن في حالات الطوارئ الحرجة يُوصى دائمًا بالاتصال الفوري بالإسعاف أو التوجه لأقرب مستشفى.',
  },
  {
    'question': 'هل يُمكن لمُغيث اقتراح علاجات منزلية؟',
    'answer':
        'في بعض الحالات البسيطة، يُمكن لمُغيث تقديم نصائح للرعاية المنزلية بناءً على إرشادات طبية معتمدة، ولكن لا يُغني ذلك عن استشارة الطبيب عند الحاجة.',
  },
  {
    'question': 'هل مُغيث يعمل بلغات متعددة؟',
    'answer':
        'نعم، يدعم مُغيث عدة لغات بما في ذلك العربية والإنجليزية، مما يسمح له بمساعدة المستخدمين من مختلف الجنسيات.',
  },
  {
    'question': 'هل يستخدم مُغيث الذكاء الاصطناعي ففط؟ ',
    'answer':
        'مُغيث يجمع بين الذكاء الاصطناعي (LLMs) واسترجاع المعلومات (RAG) مع قواعد بيانات طبية محدثة لضمان تقديم توصيات دقيقة وفعالة.',
  },
  {
    'question': 'هل يُمكن لمُغيث التنبؤ بالأمراض قبل ظهور الأعراض؟',
    'answer':
        'حاليًا، مُغيث يركز على تحليل الأعراض الموجودة، ولكن هناك خطط مستقبلية لاستخدام تقنيات تحليل البيانات الضخمة والتعلم العميق للتنبؤ بالمخاطر الصحية المحتملة.',
  },
];

final List<Map<String, String>> medicalHistoryData = [
  {
    'date': '١٢ أكتوبر ٢٠٢٥',
    'category': 'Level1',
    'status':
        'أعاني من ألم حاد في الصدر مع ضيق شديد في التنفس وسعال مستمر مصحوب بالبلغم.',
    'diagnosis': 'التهاب رئوي حاد',
    'recommendation': 'دخول المستشفى والعلاج بالمضادات الحيوية عبر الوريد',
    'details':
        'المريض يعاني من ضيق حاد في التنفس وألم في الصدر يزداد مع التنفس العميق، مصحوب بسعال مستمر مع بلغم أصفر مخضر. التشخيص يشير إلى التهاب رئوي حاد، مع احتمالية وجود عدوى بكتيرية تستدعي العلاج الفوري بالمضادات الحيوية عبر الوريد داخل المستشفى.'
  },
  {
    'date': '٢٧ أكتوبر ٢٠٢٥',
    'category': 'Level2',
    'status': 'أشعر بألم في الصدر عند التنفس العميق وسعال جاف متكرر منذ يومين.',
    'diagnosis': 'التهاب رئوي متوسط',
    'recommendation': 'الراحة في المنزل مع تناول مضادات حيوية وشرب السوائل',
    'details':
        'المريض يعاني من أعراض التهاب رئوي متوسطة، تشمل ألمًا في الصدر عند التنفس العميق، وسعالًا جافًا متكررًا، وارتفاعًا طفيفًا في درجة الحرارة. الفحص السريري والأشعة يشيران إلى التهال رئوي غير معقد، يمكن علاجه بالمضادات الحيوية عن طريق الفم مع الراحة في المنزل وشرب السوائل بكثرة.'
  },
  {
    'date': '١٢ ديسمبر ٢٠٢٥',
    'category': 'Level4',
    'status': 'أعاني من سعال خفيف مع إجهاد عام وارتفاع طفيف في درجة الحرارة.',
    'diagnosis': 'نزلة برد حادة مع التهاب رئوي بسيط',
    'recommendation': 'تناول الأدوية المسكنة وشرب السوائل الدافئة',
    'details':
        'المريض يشكو من سعال خفيف ومستمر مع إجهاد عام وارتفاع طفيف في درجة الحرارة. بعد الفحص، تم تشخيص الحالة على أنها نزلة برد حادة مع التهاب رئوي بسيط لا يستدعي دخول المستشفى. يُوصى بالراحة في المنزل، واستخدام أدوية مسكنة للحرارة والألم مثل الباراسيتامول، مع تناول الكثير من السوائل الدافئة لتعزيز التعافي وتقليل الاحتقان.'
  },
  {
    'date': '١٢ يناير ٢٠٢٤',
    'category': 'Level3',
    'status': 'أعاني من سعال خفيف مع إجهاد عام وارتفاع طفيف في درجة الحرارة.',
    'diagnosis': 'نزلة برد حادة مع التهاب رئوي بسيط',
    'recommendation': 'تناول الأدوية المسكنة وشرب السوائل الدافئة',
    'details':
        'المريض يشكو من سعال خفيف ومستمر مع إجهاد عام وارتفاع طفيف في درجة الحرارة. بعد الفحص، تم تشخيص الحالة على أنها نزلة برد حادة مع التهاب رئوي بسيط لا يستدعي دخول المستشفى. يُوصى بالراحة في المنزل، واستخدام أدوية مسكنة للحرارة والألم مثل الباراسيتامول، مع تناول الكثير من السوائل الدافئة لتعزيز التعافي وتقليل الاحتقان.'
  },
  {
    'date': '١٢ يناير ٢٠٢٤',
    'category': 'Level5',
    'status': 'أعاني من سعال خفيف مع إجهاد عام وارتفاع طفيف في درجة الحرارة.',
    'diagnosis': 'نزلة برد حادة مع التهاب رئوي بسيط',
    'recommendation': 'تناول الأدوية المسكنة وشرب السوائل الدافئة',
    'details':
        'المريض يشكو من سعال خفيف ومستمر مع إجهاد عام وارتفاع طفيف في درجة الحرارة. بعد الفحص، تم تشخيص الحالة على أنها نزلة برد حادة مع التهاب رئوي بسيط لا يستدعي دخول المستشفى. يُوصى بالراحة في المنزل، واستخدام أدوية مسكنة للحرارة والألم مثل الباراسيتامول، مع تناول الكثير من السوائل الدافئة لتعزيز التعافي وتقليل الاحتقان.'
  }
];

getCategoryStyle(String category) {
  switch (category) {
    case 'Level1':
      return {
        'color': Colors.red[400]!,
        'text': 'التصنيف: حالة حرجة جدًا',
      };
    case 'Level2':
      return {
        'color': Colors.red[400]!,
        'text': 'التصنيف:  طارئة',
      };
    case 'Level3':
      return {
        'color': Colors.red[400]!,
        'text': 'التصنيف:  حالة عاجلة',
      };
    case 'Level4':
      return {
        'color': Colors.green[400]!,
        'text': 'التصنيف: مستوى غير عاجل',
      };
    case 'Level5':
      return {
        'color': Colors.green[300]!,
        'text': 'التصنيف:  غير خطيرة',
      };
    default:
      return {
        'color': Colors.grey[400]!,
        'text': 'التصنيف: غير محدد',
      };
  }
}
